bekencorp/armino/middleware/soc/bk7235/soc/sys_struct.h
// Copyright 2020-2021 Beken 
// 
// Licensed under the Apache License, Version 2.0 (the "License");           
// you may not use this file except in compliance with the License.            
// You may obtain a copy of the License at                                     
//                                                                             
//     http://www.apache.org/licenses/LICENSE-2.0                              
//                                                                             
// Unless required by applicable law or agreed to in writing, software         
// distributed under the License is distributed on an "AS IS" BASIS,         
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.    
// See the License for the specific language governing permissions and         
// limitations under the License.                                              

/***********************************************************************************************************************************
* This file is generated from BK7256_ADDR Mapping_20211224_format_change_highlight_20220113_update.xlsm automatically                                
* Modify it manually is not recommended                                       
* CHIP ID:BK7256,GENARATE TIME:2022-03-17 20:29:38                                                 
************************************************************************************************************************************/

#pragma once                 
                            
#ifdef __cplusplus          
extern "C" {              
#endif                      

typedef volatile struct {

    /* REG_0x00 */
    union 
    { 
        struct 
        { 
           volatile uint32_t  deviceid                       :32;  //0x0[31:0], ,0x53434647,RO
        }; 
        uint32_t v; 
    }device_id; 

    /* REG_0x01 */
    union 
    { 
        struct 
        { 
           volatile uint32_t  versionid                      :32;  //0x1[31:0], ,0x72560001,RO
        }; 
        uint32_t v; 
    }version_id; 

    /* REG_0x02 */
    union 
    { 
        struct 
        { 
           volatile uint32_t  core0_halted                   : 1;  //0x2[0],core0 halt indicate,0,RO
           volatile uint32_t  core1_halted                   : 1;  //0x2[1],core1 halt indicate,0,RO
           volatile uint32_t  reserved2                      : 2;  //0x2[3:2],Reserved,0,R
           volatile uint32_t  cpu0_sw_reset                  : 1;  //0x2[4],cpu0_sw_reset indicate,0,RO
           volatile uint32_t  cpu1_sw_reset                  : 1;  //0x2[5],cpu1_sw_reset indicate,0,RO
           volatile uint32_t  reserved1                      : 2;  //0x2[7:6],Reserved,0,R
           volatile uint32_t  cpu0_pwr_dw_state              : 1;  //0x2[8],cpu0_pwr_dw_state,0,RO
           volatile uint32_t  cpu1_pwr_dw_state              : 1;  //0x2[9],cpu1_pwr_dw_state,0,RO
           volatile uint32_t  reserved0                      :22;  //0x2[31:10],Reserved,0,R
        }; 
        uint32_t v; 
    }cpu_current_run_status; 

    /* REG_0x03 */
    union 
    { 
        struct 
        { 
           volatile uint32_t  boot_mode                      : 1;  //0x3[0],0:ROM boot 1:FLASH boot,0,R/W
           volatile uint32_t  reserved2                      : 3;  //0x3[3:1],Reserved,0,R
           volatile uint32_t  rf_switch_en                   : 1;  //0x3[4],0: rf switch by PTA; 1: rf switch by SW,0,R/W
           volatile uint32_t  rf_for_wifiorbt                : 1;  //0x3[5],0: rf for wifi;  1: rf for bt,0,R/W
           volatile uint32_t  reserved1                      : 2;  //0x3[7:6],Reserved,0,R
           volatile uint32_t  jtag_core_sel                  : 1;  //0x3[8],0:jtag connect core0, 1:jtag connect core1,0,R/W
           volatile uint32_t  flash_sel                      : 1;  //0x3[9],0: normal flash operation 1:flash download by spi,0,R/W
           volatile uint32_t  reserved0                      :22;  //0x3[31:10],Reserved,0,R
        }; 
        uint32_t v; 
    }cpu_storage_connect_op_select; 

    /* REG_0x04 */
    union 
    { 
        struct 
        { 
           volatile uint32_t  cpu0_sw_rst                    : 1;  //0x4[0],reserved,0,R/W
           volatile uint32_t  cpu0_pwr_dw                    : 1;  //0x4[1],reserved,0,R/W
           volatile uint32_t  cpu0_int_mask                  : 1;  //0x4[2],Cpu0 int mask used only for sleep mode .Before sleep ,set cpu0_int_mask to 1 to mask the int of Cpu0.When cpu0 wake up,this signal set 0 automatically,0,W
           volatile uint32_t  cpu0_halt                      : 1;  //0x4[3],core0 halt indicate,0,R/W
           volatile uint32_t  cpu0_clk_div                   : 4;  //0x4[7:4],Frequency division : F/(1+N), N is the data of the reg value,0,R/W
           volatile uint32_t  cpu0_offset                    :24;  //0x4[31:8],reserved,0x0,RO
        }; 
        uint32_t v; 
    }cpu0_int_halt_clk_op; 

    /* REG_0x05 */
    union 
    { 
        struct 
        { 
           volatile uint32_t  cpu1_sw_rst                    : 1;  //0x5[0],reserved,0,R/W
           volatile uint32_t  cpu1_pwr_dw                    : 1;  //0x5[1],1:power down of cpu1,0,R/W
           volatile uint32_t  cpu1_int_mask                  : 1;  //0x5[2],Cpu1 int mask used only for sleep mode .Before sleep ,set cpu1_int_mask to 1 to mask the int of Cpu1.When cpu1 wake up,this signal set 0 automatically,0,R/W
           volatile uint32_t  cpu1_halt                      : 1;  //0x5[3],core1 halt indicate,0,R/W
           volatile uint32_t  cpu1_clk_div                   : 4;  //0x5[7:4],Frequency division : F/(1+N), N is the data of the reg value,0,R/W
           volatile uint32_t  cpu1_offset                    :24;  //0x5[31:8],reserved,0x0,R/W
        }; 
        uint32_t v; 
    }cpu1_int_halt_clk_op; 

    /* REG_0x06 */
    union 
    { 
        struct 
        { 
           volatile uint32_t  reserved                       :32;  //0x6[31:0] , ,None,None
        }; 
        uint32_t v; 
    }reserved_reg0x6; 

    /* REG_0x07 */
    union 
    { 
        struct 
        { 
           volatile uint32_t reserved:32;  
        }; 
        uint32_t v; 
    }reg_0x7_reserved; 

