bekencorp/armino/middleware/soc/bk7235/soc/sys_struct.h
    /* REG_0x08 */
    union 
    { 
        struct 
        { 
           volatile uint32_t  clkdiv_core                    : 4;  //0x8[3:0],Frequency division : F/(1+N), N is the data of the reg value,0,R/W
           volatile uint32_t  cksel_core                     : 2;  //0x8[5:4],0:XTAL       1 : clk_DCO      2 : 320M      3 : 480M,0,R/W
           volatile uint32_t  clkdiv_bus                     : 1;  //0x8[6],Frequency division : F/(1+N), N is the data of the reg value,0,R/W
           volatile uint32_t  reserved0                      : 1;  //0x8[7:7],Reserved,0,R
           volatile uint32_t  clkdiv_uart0                   : 2;  //0x8[9:8],Frequency division :    0:/1  1:/2  2:/4  3:/8,0,R/W
           volatile uint32_t  clksel_uart0                   : 1;  //0x8[10],0:XTAL              1:APLL,0,R/W
           volatile uint32_t  clkdiv_uart1                   : 2;  //0x8[12:11],Frequency division :    0:/1  1:/2  2:/4  3:/8,0,R/W
           volatile uint32_t  cksel_uart1                    : 1;  //0x8[13],0:XTAL              1:APLL,0,R/W
           volatile uint32_t  clkdiv_uart2                   : 2;  //0x8[15:14],Frequency division :    0:/1  1:/2  2:/4  3:/8,0,R/W
           volatile uint32_t  cksel_uart2                    : 1;  //0x8[16],0:XTAL              1:APLL,0,R/W
           volatile uint32_t  cksel_sadc                     : 1;  //0x8[17],0:XTAL              1:APLL,0,R/W
           volatile uint32_t  cksel_pwm0                     : 1;  //0x8[18],0:clk32              1:XTAL,0,R/W
           volatile uint32_t  cksel_pwm1                     : 1;  //0x8[19],0:clk32              1:XTAL,0,R/W
           volatile uint32_t  cksel_timer0                   : 1;  //0x8[20],0:clk32              1:XTAL,0,R/W
           volatile uint32_t  cksel_timer1                   : 1;  //0x8[21],0:clk32              1:XTAL,0,R/W
           volatile uint32_t  cksel_timer2                   : 1;  //0x8[22],0:clk32              1:XTAL,0,R/W
           volatile uint32_t  cksel_can                      : 1;  //0x8[23],0:XTAL              1:80M,0,R/W
           volatile uint32_t  cksel_i2s                      : 1;  //0x8[24],0:XTAL              1:APLL,0,R/W
           volatile uint32_t  cksel_aud                      : 1;  //0x8[25],0:XTAL              1:APLL,0,R/W
           volatile uint32_t  clkdiv_jpeg                    : 4;  //0x8[29:26],Frequency division : F/(1+N), N is the data of the reg value,0,R/W
           volatile uint32_t  cksel_jpeg                     : 1;  //0x8[30],0:clk_320M      1:clk_480M,0,R/W
           volatile uint32_t  clkdiv_disp_l                  : 1;  //0x8[31],Frequency division : F/(1+clkdiv_disp_l+clkdiv_disp_h*2),0,R/W
        }; 
        uint32_t v; 
    }cpu_clk_div_mode1; 

    /* REG_0x09 */
    union 
    { 
        struct 
        { 
           volatile uint32_t  clkdiv_disp_h                  : 3;  //0x9[2:0],Frequency division : F/(1+clkdiv_disp_l+clkdiv_disp_h*2),0,R/W
           volatile uint32_t  cksel_disp                     : 1;  //0x9[3],0:clk_320M      1:clk_480M,0,R/W
           volatile uint32_t  ckdiv_psram                    : 1;  //0x9[4],Frequency division : F/(1+N), N is the data of the reg value,0,R/W
           volatile uint32_t  cksel_psram                    : 1;  //0x9[5],0:clk_320M      1:clk_480M,0,R/W
           volatile uint32_t  ckdiv_qspi0                    : 4;  //0x9[9:6],Frequency division : F/(1+N), N is the data of the reg value,0,R/W
           volatile uint32_t  cksel_qspi0                    : 1;  //0x9[10],0:clk_320M      1:clk_480M,0,R/W
           volatile uint32_t  reserved                       : 3;  //0x9[13:11], ,None,None
           volatile uint32_t  ckdiv_sdio                     : 3;  //0x9[16:14],0:/2  1:/4  2:/6  3:/8  4:/10  5:/12  6:/16  7:/256,0,R/W
           volatile uint32_t  cksel_sdio                     : 1;  //0x9[17],0：XTAL          1：320M,0,R/W
           volatile uint32_t  ckdiv_auxs                     : 4;  //0x9[21:18],Frequency division : F/(1+N), N is the data of the reg value,0,R/W
           volatile uint32_t  cksel_auxs                     : 2;  //0x9[23:22],0:DCO              1:APLL                2:320M                     4:480M,0,R/W
           volatile uint32_t  cksel_flash                    : 2;  //0x9[25:24],0:XTAL             1 :clk_120M        2/3: APLL  ,0,R/W
           volatile uint32_t  ckdiv_flash                    : 2;  //0x9[27:26],0:/1  1:/2  2:/4  3:/8,0,R/W
           volatile uint32_t  ckdiv_i2s0                     : 3;  //0x9[30:28],0:/1  1:/2  2:/4  3:/8  4:/16  5:/32  6:/64  7:/256,0,R/W
           volatile uint32_t  reserved0                      : 1;  //0x9[31:31],Reserved,0,R
        }; 
        uint32_t v; 
    }cpu_clk_div_mode2; 

    /* REG_0x0a */
    union 
    { 
        struct 
        { 
           volatile uint32_t  ckdiv_26m                      : 2;  //0xa[1:0],0:/1  1:/2  2:/4  3:/8,0,R/W
           volatile uint32_t  ckdiv_wdt                      : 2;  //0xa[3:2],0:/2 1:/4 2:/8 3:/16,0,R/W
           volatile uint32_t  clksel_spi0                    : 1;  //0xa[4],0:XTAL              1:APLL,0,R/W
           volatile uint32_t  clksel_spi1                    : 1;  //0xa[5],0:XTAL              1:APLL,0,R/W
           volatile uint32_t  reserved0                      :26;  //0xa[31:6],Reserved,0,R
        }; 
        uint32_t v; 
    }cpu_26m_wdt_clk_div; 

    /* REG_0x0b */
    union 
    { 
        struct 
        { 
           volatile uint32_t  anaspi_freq                    : 6;  //0xb[5:0],frequency for analog spi,0,R/W
           volatile uint32_t  reserved1                      : 2;  //0xb[7:6],Reserved,0,R
           volatile uint32_t  anareg_state                   :20;  //0xb[27:8],analog register state:; 0x0: register write is idle; 0x1: register write is busy,0,RO
           volatile uint32_t  reserved0                      : 4;  //0xb[31:28],Reserved,0,R
        }; 
        uint32_t v; 
    }cpu_anaspi_freq; 

    /* REG_0x0c */
    union 
    { 
        struct 
        { 
           volatile uint32_t  i2c0_cken                      : 1;  //0xc[0],1:i2c0_clk enable,0,R/W
           volatile uint32_t  spi0_cken                      : 1;  //0xc[1],1:spi0_clk enable ,0,R/W
           volatile uint32_t  uart0_cken                     : 1;  //0xc[2],1:uart0_clk enable,0,R/W
           volatile uint32_t  pwm0_cken                      : 1;  //0xc[3],1:pwm0_clk enable ,0,R/W
           volatile uint32_t  tim0_cken                      : 1;  //0xc[4],1:tim0_clk enable ,0,R/W
           volatile uint32_t  sadc_cken                      : 1;  //0xc[5],1:sadc_clk enable ,0,R/W
           volatile uint32_t  irda_cken                      : 1;  //0xc[6],1:irda_clk enable ,0,R/W
           volatile uint32_t  efuse_cken                     : 1;  //0xc[7],1:efuse_clk enable,0,R/W
           volatile uint32_t  i2c1_cken                      : 1;  //0xc[8],1:i2c1_clk enable ,0,R/W
           volatile uint32_t  spi1_cken                      : 1;  //0xc[9],1:spi1_clk enable ,0,R/W
           volatile uint32_t  uart1_cken                     : 1;  //0xc[10],1:uart1_clk enable,0,R/W
           volatile uint32_t  uart2_cken                     : 1;  //0xc[11],1:uart2_clk enable,0,R/W
           volatile uint32_t  pwm1_cken                      : 1;  //0xc[12],1:pwm1_clk enable ,0,R/W
           volatile uint32_t  tim1_cken                      : 1;  //0xc[13],1:tim1_clk enable ,0,R/W
           volatile uint32_t  tim2_cken                      : 1;  //0xc[14],1:tim2_clk enable ,0,R/W
           volatile uint32_t  otp_cken                       : 1;  //0xc[15],1:otp_clk enable  ,1,R/W
           volatile uint32_t  i2s_cken                       : 1;  //0xc[16],1:i2s_clk enable  ,0,R/W
           volatile uint32_t  usb_cken                       : 1;  //0xc[17],1:usb_clk enable  ,0,R/W
           volatile uint32_t  can_cken                       : 1;  //0xc[18],1:can_clk enable  ,0,R/W
           volatile uint32_t  psram_cken                     : 1;  //0xc[19],1:psram_clk enable,0,R/W
           volatile uint32_t  qspi0_cken                     : 1;  //0xc[20],1:qspi0_clk enable,0,R/W
           volatile uint32_t  qspi1_cken                     : 1;  //0xc[21],1:qspi1_clk enable,0,R/W
           volatile uint32_t  sdio_cken                      : 1;  //0xc[22],1:sdio_clk enable ,0,R/W
           volatile uint32_t  auxs_cken                      : 1;  //0xc[23],1:auxs_clk enable ,0,R/W
           volatile uint32_t  btdm_cken                      : 1;  //0xc[24],1:btdm_clk enable ,0,R/W
           volatile uint32_t  xvr_cken                       : 1;  //0xc[25],1:xvr_clk enable  ,0,R/W
           volatile uint32_t  mac_cken                       : 1;  //0xc[26],1:mac_clk enable  ,0,R/W
           volatile uint32_t  phy_cken                       : 1;  //0xc[27],1:phy_clk enable  ,0,R/W
           volatile uint32_t  jpeg_cken                      : 1;  //0xc[28],1:jpeg_clk enable ,0,R/W
           volatile uint32_t  disp_cken                      : 1;  //0xc[29],1:disp_clk enable ,0,R/W
           volatile uint32_t  aud_cken                       : 1;  //0xc[30],1:aud_clk enable  ,0,R/W
           volatile uint32_t  wdt_cken                       : 1;  //0xc[31],1:wdt_clk enable  ,0,R/W
        }; 
        uint32_t v; 
    }cpu_device_clk_enable; 

    /* REG_0x0d */
    union 
    { 
        struct 
        { 
           volatile uint32_t  reserved                       :32;  //0xd[31:0], ,None,None
        }; 
        uint32_t v; 
    }reserver_reg0xd; 

    /* REG_0x0e */
    union 
    { 
        struct 
        { 
           volatile uint32_t  aon_disckg                     : 1;  //0xe[0],BUS_CLK  ENABLE,0: bus clock open when module is select,1:bus clock always open,0,R/W
           volatile uint32_t  sys_disckg                     : 1;  //0xe[1],BUS_CLK  ENABLE,0: bus clock open when module is select,1:bus clock always open,0,R/W
           volatile uint32_t  dma_disckg                     : 1;  //0xe[2],BUS_CLK  ENABLE,0: bus clock open when module is select,1:bus clock always open,0,R/W
           volatile uint32_t  flash_disckg                   : 1;  //0xe[3],BUS_CLK  ENABLE,0: bus clock open when module is select,1:bus clock always open,0,R/W
           volatile uint32_t  wdt_disckg                     : 1;  //0xe[4],BUS_CLK  ENABLE,0: bus clock open when module is select,1:bus clock always open,0,R/W
           volatile uint32_t  tim_disckg                     : 1;  //0xe[5],BUS_CLK  ENABLE,0: bus clock open when module is select,1:bus clock always open,0,R/W
           volatile uint32_t  urt_disckg                     : 1;  //0xe[6],BUS_CLK  ENABLE,0: bus clock open when module is select,1:bus clock always open,0,R/W
           volatile uint32_t  pwm_disckg                     : 1;  //0xe[7],BUS_CLK  ENABLE,0: bus clock open when module is select,1:bus clock always open,0,R/W
           volatile uint32_t  i2c_disckg                     : 1;  //0xe[8],BUS_CLK  ENABLE,0: bus clock open when module is select,1:bus clock always open,0,R/W
           volatile uint32_t  spi_disckg                     : 1;  //0xe[9],BUS_CLK  ENABLE,0: bus clock open when module is select,1:bus clock always open,0,R/W
           volatile uint32_t  sadc_disckg                    : 1;  //0xe[10],BUS_CLK  ENABLE,0: bus clock open when module is select,1:bus clock always open,0,R/W
           volatile uint32_t  efs_disckg                     : 1;  //0xe[11],BUS_CLK  ENABLE,0: bus clock open when module is select,1:bus clock always open,0,R/W
           volatile uint32_t  irda_disckg                    : 1;  //0xe[12],BUS_CLK  ENABLE,0: bus clock open when module is select,1:bus clock always open,0,R/W
           volatile uint32_t  trng_disckg                    : 1;  //0xe[13],BUS_CLK  ENABLE,0: bus clock open when module is select,1:bus clock always open,0,R/W
           volatile uint32_t  sdio_disckg                    : 1;  //0xe[14],BUS_CLK  ENABLE,0: bus clock open when module is select,1:bus clock always open,0,R/W
           volatile uint32_t  la_disckg                      : 1;  //0xe[15],BUS_CLK  ENABLE,0: bus clock open when module is select,1:bus clock always open,0,R/W
           volatile uint32_t  tim1_disckg                    : 1;  //0xe[16],BUS_CLK  ENABLE,0: bus clock open when module is select,1:bus clock always open,0,R/W
           volatile uint32_t  urt1_disckg                    : 1;  //0xe[17],BUS_CLK  ENABLE,0: bus clock open when module is select,1:bus clock always open,0,R/W
           volatile uint32_t  urt2_disckg                    : 1;  //0xe[18],BUS_CLK  ENABLE,0: bus clock open when module is select,1:bus clock always open,0,R/W
           volatile uint32_t  pwm1_disckg                    : 1;  //0xe[19],BUS_CLK  ENABLE,0: bus clock open when module is select,1:bus clock always open,0,R/W
           volatile uint32_t  i2c1_disckg                    : 1;  //0xe[20],BUS_CLK  ENABLE,0: bus clock open when module is select,1:bus clock always open,0,R/W
           volatile uint32_t  spi1_disckg                    : 1;  //0xe[21],BUS_CLK  ENABLE,0: bus clock open when module is select,1:bus clock always open,0,R/W
           volatile uint32_t  usb_disckg                     : 1;  //0xe[22],BUS_CLK  ENABLE,0: bus clock open when module is select,1:bus clock always open,0,R/W
           volatile uint32_t  can_disckg                     : 1;  //0xe[23],BUS_CLK  ENABLE,0: bus clock open when module is select,1:bus clock always open,0,R/W
           volatile uint32_t  qspi0_disckg                   : 1;  //0xe[24],BUS_CLK  ENABLE,0: bus clock open when module is select,1:bus clock always open,0,R/W
           volatile uint32_t  psram_disckg                   : 1;  //0xe[25],BUS_CLK  ENABLE,0: bus clock open when module is select,1:bus clock always open,0,R/W
           volatile uint32_t  fft_disckg                     : 1;  //0xe[26],BUS_CLK  ENABLE,0: bus clock open when module is select,1:bus clock always open,0,R/W
           volatile uint32_t  sbc_disckg                     : 1;  //0xe[27],BUS_CLK  ENABLE,0: bus clock open when module is select,1:bus clock always open,0,R/W
           volatile uint32_t  aud_disckg                     : 1;  //0xe[28],BUS_CLK  ENABLE,0: bus clock open when module is select,1:bus clock always open,0,R/W
           volatile uint32_t  i2s_disckg                     : 1;  //0xe[29],BUS_CLK  ENABLE,0: bus clock open when module is select,1:bus clock always open,0,R/W
           volatile uint32_t  jpeg_disckg                    : 1;  //0xe[30],BUS_CLK  ENABLE,0: bus clock open when module is select,1:bus clock always open,0,R/W
           volatile uint32_t  jpeg_dec_disckg                : 1;  //0xe[31],BUS_CLK  ENABLE,0: bus clock open when module is select,1:bus clock always open,0,R/W
        }; 
        uint32_t v; 
    }cpu_mode_disckg1; 

    /* REG_0x0f */
    union 
    { 
        struct 
        { 
           volatile uint32_t  disp_disckg                    : 1;  //0xf[0],BUS_CLK  ENABLE,0: bus clock open when module is select,1:bus clock always open,0,R/W
           volatile uint32_t  dma2d_disckg                   : 1;  //0xf[1],BUS_CLK  ENABLE,0: bus clock open when module is select,1:bus clock always open,0,R/W
           volatile uint32_t  reserved                       : 1;  //0xf[2],BUS_CLK  ENABLE,0: bus clock open when module is select,1:bus clock always open,0,R/W
           volatile uint32_t  btdm_disckg                    : 1;  //0xf[3],BUS_CLK  ENABLE,0: bus clock open when module is select,1:bus clock always open,0,R/W
           volatile uint32_t  xver_disckg                    : 1;  //0xf[4],BUS_CLK  ENABLE,0: bus clock open when module is select,1:bus clock always open,0,R/W
           volatile uint32_t  btdm_bps_ckg                   : 4;  //0xf[8:5],BUS_CLK  ENABLE,0: bus clock open when module is select,1:bus clock always open,0,R/W
           volatile uint32_t  reserved0                      :23;  //0xf[31:9],Reserved,0,R
        }; 
        uint32_t v; 
    }cpu_mode_disckg2; 

    /* REG_0x10 */
    union 
    { 
        struct 
        { 
           volatile uint32_t  pwd_mem1                       : 1;  //0x10[0],0:power on of mem1      ,0,RW
           volatile uint32_t  pwd_mem2                       : 1;  //0x10[1],0:power on of mem2      ,0,RW
           volatile uint32_t  pwd_mem3                       : 1;  //0x10[2],0:power on of mem3      ,0,RW
           volatile uint32_t  pwd_encp                       : 1;  //0x10[3],0:power on of encp      ,0,RW
           volatile uint32_t  pwd_bakp                       : 1;  //0x10[4],0:power on of bakp      ,0,RW
           volatile uint32_t  pwd_ahbp                       : 1;  //0x10[5],0:power on of ahbp      ,0,RW
           volatile uint32_t  pwd_audp                       : 1;  //0x10[6],0:power on of audp      ,0,RW
           volatile uint32_t  pwd_vidp                       : 1;  //0x10[7],0:power on of vidp      ,0,RW
           volatile uint32_t  pwd_btsp                       : 1;  //0x10[8],0:power on of btsp      ,0,RW
           volatile uint32_t  pwd_wifp_mac                   : 1;  //0x10[9],0:power on of wifp_mac  ,0,RW
           volatile uint32_t  pwd_wifp_phy                   : 1;  //0x10[10],0:power on of wifp_phy  ,0,RW
           volatile uint32_t  pwd_mem0                       : 1;  //0x10[11] ,0:power on of mem0,0,RW
           volatile uint32_t  reserved1                      : 4;  //0x10[15:12],Reserved,0,R
           volatile uint32_t  sleep_en_need_flash_idle       : 1;  //0x10[16],0:sleep_en of flash_idle,0,RW
           volatile uint32_t  sleep_en_need_cpu1_wfi         : 1;  //0x10[17],0:sleep_en of cpu1_wfi  ,0,RW
           volatile uint32_t  sleep_en_need_cpu0_wfi         : 1;  //0x10[18],0:sleep_en of cpu0_wfi  ,0,RW
           volatile uint32_t  sleep_en_global                : 1;  //0x10[19],0:sleep_en of global    ,0,RW
           volatile uint32_t  wifi_wakeup_platform_en        : 1;  //0x10[20],0:wifi_wakeup_en        ,0,RW
           volatile uint32_t  bts_wakeup_platform_en         : 1;  //0x10[21],0:bts_wakeup_en         ,0,RW
           volatile uint32_t  bts_sleep_exit_req             : 1;  //0x10[22],0:bt sleep exit request ,0,RW
           volatile uint32_t  reserved0                      : 9;  //0x10[31:23],Reserved,0,R
        }; 
        uint32_t v; 
    }cpu_power_sleep_wakeup; 

    /* REG_0x11 */
    union 
    { 
        struct 
        { 
           volatile uint32_t  reserved                       :32;  //0x11[31:0], ,None,None
        }; 
        uint32_t v; 
    }reserver_reg0x11; 

