bekencorp/armino/middleware/soc/bk7235/soc/sys_struct.h
    /* REG_0x22 */
    union 
    { 
        struct 
        { 
           volatile uint32_t  cpu1_bmc32_int_en              : 1;  //0x22[0], ,0,R/W
           volatile uint32_t  cpu1_host_0_irq_en             : 1;  //0x22[1], ,0,R/W
           volatile uint32_t  cpu1_host_0_sec_irq_en         : 1;  //0x22[2], ,0,R/W
           volatile uint32_t  cpu1_timer_int_en              : 1;  //0x22[3], ,0,R/W
           volatile uint32_t  cpu1_uart_int_en               : 1;  //0x22[4], ,0,R/W
           volatile uint32_t  cpu1_pwm_int_en                : 1;  //0x22[5], ,0,R/W
           volatile uint32_t  cpu1_i2c_int_en                : 1;  //0x22[6], ,0,R/W
           volatile uint32_t  cpu1_spi_int_en                : 1;  //0x22[7], ,0,R/W
           volatile uint32_t  cpu1_sadc_int_en               : 1;  //0x22[8], ,0,R/W
           volatile uint32_t  cpu1_irda_int_en               : 1;  //0x22[9], ,0,R/W
           volatile uint32_t  cpu1_sdio_int_en               : 1;  //0x22[10], ,0,R/W
           volatile uint32_t  cpu1_gdma_int_en               : 1;  //0x22[11], ,0,R/W
           volatile uint32_t  cpu1_la_int_en                 : 1;  //0x22[12], ,0,R/W
           volatile uint32_t  cpu1_timer1_int_en             : 1;  //0x22[13], ,0,R/W
           volatile uint32_t  cpu1_i2c1_int_en               : 1;  //0x22[14], ,0,R/W
           volatile uint32_t  cpu1_uart1_int_en              : 1;  //0x22[15], ,0,R/W
           volatile uint32_t  cpu1_uart2_int_en              : 1;  //0x22[16], ,0,R/W
           volatile uint32_t  cpu1_spi1_int_en               : 1;  //0x22[17], ,0,R/W
           volatile uint32_t  cpu1_can_int_en                : 1;  //0x22[18], ,0,R/W
           volatile uint32_t  cpu1_usb_int_en                : 1;  //0x22[19], ,0,R/W
           volatile uint32_t  cpu1_qspi_int_en               : 1;  //0x22[20], ,0,R/W
           volatile uint32_t  cpu1_fft_int_en                : 1;  //0x22[21], ,0,R/W
           volatile uint32_t  cpu1_sbc_int_en                : 1;  //0x22[22], ,0,R/W
           volatile uint32_t  cpu1_aud_int_en                : 1;  //0x22[23], ,0,R/W
           volatile uint32_t  cpu1_i2s_int_en                : 1;  //0x22[24], ,0,R/W
           volatile uint32_t  cpu1_jpegenc_int_en            : 1;  //0x22[25], ,0,R/W
           volatile uint32_t  cpu1_jpegdec_int_en            : 1;  //0x22[26], ,0,R/W
           volatile uint32_t  cpu1_lcd_int_en                : 1;  //0x22[27], ,0,R/W
           volatile uint32_t  cpu1_dma2d_int_en              : 1;  //0x22[28], ,0,R/W
           volatile uint32_t  cpu1_wifi_int_phy_mpb_en       : 1;  //0x22[29], ,0,R/W
           volatile uint32_t  cpu1_wifi_int_phy_riu_en       : 1;  //0x22[30], ,0,R/W
           volatile uint32_t  cpu1_wifi_mac_int_tx_rx_timer_en : 1;  //0x22[31], ,0,R/W
        }; 
        uint32_t v; 
    }cpu1_int_0_31_en; 

    /* REG_0x23 */
    union 
    { 
        struct 
        { 
           volatile uint32_t  cpu1_wifi_mac_int_tx_rx_misc_en : 1;  //0x23[0], ,0,R/W
           volatile uint32_t  cpu1_wifi_mac_int_rx_trigger_en : 1;  //0x23[1], ,0,R/W
           volatile uint32_t  cpu1_wifi_mac_int_tx_trigger_en : 1;  //0x23[2], ,0,R/W
           volatile uint32_t  cpu1_wifi_mac_int_prot_trigger_en : 1;  //0x23[3], ,0,R/W
           volatile uint32_t  cpu1_wifi_mac_int_gen_en       : 1;  //0x23[4], ,0,R/W
           volatile uint32_t  cpu1_wifi_hsu_irq_en           : 1;  //0x23[5], ,0,R/W
           volatile uint32_t  cpu1_wifi_int_mac_wakeup_en    : 1;  //0x23[6], ,0,R/W
           volatile uint32_t  cpu1_dm_irq_en                 : 1;  //0x23[7], ,0,R/W
           volatile uint32_t  cpu1_ble_irq_en                : 1;  //0x23[8], ,0,R/W
           volatile uint32_t  cpu1_bt_irq_en                 : 1;  //0x23[9], ,0,R/W
           volatile uint32_t  reserved2                      : 6;  //0x23[15:10], ,0,R/W
           volatile uint32_t  cpu1_mbox0_int_en              : 1;  //0x23[16], ,0,R/W
           volatile uint32_t  cpu1_mbox1_int_en              : 1;  //0x23[17], ,0,R/W
           volatile uint32_t  cpu1_bmc64_int_en              : 1;  //0x23[18], ,0,R/W
           volatile uint32_t  reserved3                      : 1;  //0x23[19], ,0,R/W
           volatile uint32_t  cpu1_touched_int_en            : 1;  //0x23[20], ,0,R/W
           volatile uint32_t  cpu1_usbplug_int_en            : 1;  //0x23[21], ,0,R/W
           volatile uint32_t  cpu1_rtc_int_en                : 1;  //0x23[22], ,0,R/W
           volatile uint32_t  cpu1_gpio_int_en               : 1;  //0x23[23], ,0,R/W
           volatile uint32_t  reserved4                      : 8;  //0x23[31:24], ,0,R/W
        }; 
        uint32_t v; 
    }cpu1_int_32_63_en; 

    /* REG_0x24 */
    union 
    { 
        struct 
        { 
           volatile uint32_t reserved:32;  
        }; 
        uint32_t v; 
    }reg_0x24_reserved; 

    /* REG_0x25 */
    union 
    { 
        struct 
        { 
           volatile uint32_t reserved:32;  
        }; 
        uint32_t v; 
    }reg_0x25_reserved; 

    /* REG_0x26 */
    union 
    { 
        struct 
        { 
           volatile uint32_t reserved:32;  
        }; 
        uint32_t v; 
    }reg_0x26_reserved; 

    /* REG_0x27 */
    union 
    { 
        struct 
        { 
           volatile uint32_t reserved:32;  
        }; 
        uint32_t v; 
    }reg_0x27_reserved; 

    /* REG_0x28 */
    union 
    { 
        struct 
        { 
           volatile uint32_t  cpu0_bmc32_int_st              : 1;  //0x28[0], ,0,R
           volatile uint32_t  cpu0_host_0_irq_st             : 1;  //0x28[1], ,0,R
           volatile uint32_t  cpu0_host_0_sec_irq_st         : 1;  //0x28[2], ,0,R
           volatile uint32_t  cpu0_timer_int_st              : 1;  //0x28[3], ,0,R
           volatile uint32_t  cpu0_uart_int_st               : 1;  //0x28[4], ,0,R
           volatile uint32_t  cpu0_pwm_int_st                : 1;  //0x28[5], ,0,R
           volatile uint32_t  cpu0_i2c_int_st                : 1;  //0x28[6], ,0,R
           volatile uint32_t  cpu0_spi_int_st                : 1;  //0x28[7], ,0,R
           volatile uint32_t  cpu0_sadc_int_st               : 1;  //0x28[8], ,0,R
           volatile uint32_t  cpu0_irda_int_st               : 1;  //0x28[9], ,0,R
           volatile uint32_t  cpu0_sdio_int_st               : 1;  //0x28[10], ,0,R
           volatile uint32_t  cpu0_gdma_int_st               : 1;  //0x28[11], ,0,R
           volatile uint32_t  cpu0_la_int_st                 : 1;  //0x28[12], ,0,R
           volatile uint32_t  cpu0_timer1_int_st             : 1;  //0x28[13], ,0,R
           volatile uint32_t  cpu0_i2c1_int_st               : 1;  //0x28[14], ,0,R
           volatile uint32_t  cpu0_uart1_int_st              : 1;  //0x28[15], ,0,R
           volatile uint32_t  cpu0_uart2_int_st              : 1;  //0x28[16], ,0,R
           volatile uint32_t  cpu0_spi1_int_st               : 1;  //0x28[17], ,0,R
           volatile uint32_t  cpu0_can_int_st                : 1;  //0x28[18], ,0,R
           volatile uint32_t  cpu0_usb_int_st                : 1;  //0x28[19], ,0,R
           volatile uint32_t  cpu0_qspi_int_st               : 1;  //0x28[20], ,0,R
           volatile uint32_t  cpu0_fft_int_st                : 1;  //0x28[21], ,0,R
           volatile uint32_t  cpu0_sbc_int_st                : 1;  //0x28[22], ,0,R
           volatile uint32_t  cpu0_aud_int_st                : 1;  //0x28[23], ,0,R
           volatile uint32_t  cpu0_i2s_int_st                : 1;  //0x28[24], ,0,R
           volatile uint32_t  cpu0_jpegenc_int_st            : 1;  //0x28[25], ,0,R
           volatile uint32_t  cpu0_jpegdec_int_st            : 1;  //0x28[26], ,0,R
           volatile uint32_t  cpu0_lcd_int_st                : 1;  //0x28[27], ,0,R
           volatile uint32_t  reserved                       : 1;  //0x28[28], ,0,R
           volatile uint32_t  cpu0_wifi_int_phy_mpb_st       : 1;  //0x28[29], ,0,R
           volatile uint32_t  cpu0_wifi_int_phy_riu_st       : 1;  //0x28[30], ,0,R
           volatile uint32_t  cpu0_wifi_mac_int_tx_rx_timer_st : 1;  //0x28[31], ,0,R
        }; 
        uint32_t v; 
    }cpu0_int_0_31_status; 

    /* REG_0x29 */
    union 
    { 
        struct 
        { 
           volatile uint32_t  cpu0_wifi_mac_int_tx_rx_misc_st : 1;  //0x29[0], ,0,R
           volatile uint32_t  cpu0_wifi_mac_int_rx_trigger_st : 1;  //0x29[1], ,0,R
           volatile uint32_t  cpu0_wifi_mac_int_tx_trigger_st : 1;  //0x29[2], ,0,R
           volatile uint32_t  cpu0_wifi_mac_int_prot_trigger_st : 1;  //0x29[3], ,0,R
           volatile uint32_t  cpu0_wifi_mac_int_gen_st       : 1;  //0x29[4], ,0,R
           volatile uint32_t  cpu0_wifi_hsu_irq_st           : 1;  //0x29[5], ,0,R
           volatile uint32_t  cpu0_wifi_int_mac_wakeup_st    : 1;  //0x29[6], ,0,R
           volatile uint32_t  cpu0_dm_irq_st                 : 1;  //0x29[7], ,0,R
           volatile uint32_t  cpu0_ble_irq_st                : 1;  //0x29[8], ,0,R
           volatile uint32_t  cpu0_bt_irq_st                 : 1;  //0x29[9], ,0,R
           volatile uint32_t  reserved2                      : 6;  //0x29[15:10], ,0,R
           volatile uint32_t  cpu0_mbox0_int_st              : 1;  //0x29[16], ,0,R
           volatile uint32_t  cpu0_mbox1_int_st              : 1;  //0x29[17], ,0,R
           volatile uint32_t  cpu0_bmc64_int_st              : 1;  //0x29[18], ,0,R
           volatile uint32_t  reserved3                      : 1;  //0x29[19], ,0,R
           volatile uint32_t  cpu0_touched_int_st            : 1;  //0x29[20], ,0,R
           volatile uint32_t  cpu0_usbplug_int_st            : 1;  //0x29[21], ,0,R
           volatile uint32_t  cpu0_rtc_int_st                : 1;  //0x29[22], ,0,R
           volatile uint32_t  cpu0_gpio_int_st               : 1;  //0x29[23], ,0,R
           volatile uint32_t  reserved4                      : 8;  //0x29[31:24], ,0,R
        }; 
        uint32_t v; 
    }cpu0_int_32_63_status; 

