bekencorp/armino/middleware/soc/bk7235/soc/sys_struct.h
    /* REG_0x2a */
    union 
    { 
        struct 
        { 
           volatile uint32_t  cpu1_bmc32_int_st              : 1;  //0x2a[0], ,0,R
           volatile uint32_t  cpu1_host_0_irq_st             : 1;  //0x2a[1], ,0,R
           volatile uint32_t  cpu1_host_0_sec_irq_st         : 1;  //0x2a[2], ,0,R
           volatile uint32_t  cpu1_timer_int_st              : 1;  //0x2a[3], ,0,R
           volatile uint32_t  cpu1_uart_int_st               : 1;  //0x2a[4], ,0,R
           volatile uint32_t  cpu1_pwm_int_st                : 1;  //0x2a[5], ,0,R
           volatile uint32_t  cpu1_i2c_int_st                : 1;  //0x2a[6], ,0,R
           volatile uint32_t  cpu1_spi_int_st                : 1;  //0x2a[7], ,0,R
           volatile uint32_t  cpu1_sadc_int_st               : 1;  //0x2a[8], ,0,R
           volatile uint32_t  cpu1_irda_int_st               : 1;  //0x2a[9], ,0,R
           volatile uint32_t  cpu1_sdio_int_st               : 1;  //0x2a[10], ,0,R
           volatile uint32_t  cpu1_gdma_int_st               : 1;  //0x2a[11], ,0,R
           volatile uint32_t  cpu1_la_int_st                 : 1;  //0x2a[12], ,0,R
           volatile uint32_t  cpu1_timer1_int_st             : 1;  //0x2a[13], ,0,R
           volatile uint32_t  cpu1_i2c1_int_st               : 1;  //0x2a[14], ,0,R
           volatile uint32_t  cpu1_uart1_int_st              : 1;  //0x2a[15], ,0,R
           volatile uint32_t  cpu1_uart2_int_st              : 1;  //0x2a[16], ,0,R
           volatile uint32_t  cpu1_spi1_int_st               : 1;  //0x2a[17], ,0,R
           volatile uint32_t  cpu1_can_int_st                : 1;  //0x2a[18], ,0,R
           volatile uint32_t  cpu1_usb_int_st                : 1;  //0x2a[19], ,0,R
           volatile uint32_t  cpu1_qspi_int_st               : 1;  //0x2a[20], ,0,R
           volatile uint32_t  cpu1_fft_int_st                : 1;  //0x2a[21], ,0,R
           volatile uint32_t  cpu1_sbc_int_st                : 1;  //0x2a[22], ,0,R
           volatile uint32_t  cpu1_aud_int_st                : 1;  //0x2a[23], ,0,R
           volatile uint32_t  cpu1_i2s_int_st                : 1;  //0x2a[24], ,0,R
           volatile uint32_t  cpu1_jpegenc_int_st            : 1;  //0x2a[25], ,0,R
           volatile uint32_t  cpu1_jpegdec_int_st            : 1;  //0x2a[26], ,0,R
           volatile uint32_t  cpu1_lcd_int_st                : 1;  //0x2a[27], ,0,R
           volatile uint32_t  reserved                       : 1;  //0x2a[28], ,0,R
           volatile uint32_t  cpu1_wifi_int_phy_mpb_st       : 1;  //0x2a[29], ,0,R
           volatile uint32_t  cpu1_wifi_int_phy_riu_st       : 1;  //0x2a[30], ,0,R
           volatile uint32_t  cpu1_wifi_mac_int_tx_rx_timer_st : 1;  //0x2a[31], ,0,R
        }; 
        uint32_t v; 
    }cpu1_int_0_31_status; 

    /* REG_0x2b */
    union 
    { 
        struct 
        { 
           volatile uint32_t  cpu1_wifi_mac_int_tx_rx_misc_st : 1;  //0x2b[0], ,0,R
           volatile uint32_t  cpu1_wifi_mac_int_rx_trigger_st : 1;  //0x2b[1], ,0,R
           volatile uint32_t  cpu1_wifi_mac_int_tx_trigger_st : 1;  //0x2b[2], ,0,R
           volatile uint32_t  cpu1_wifi_mac_int_prot_trigger_st : 1;  //0x2b[3], ,0,R
           volatile uint32_t  cpu1_wifi_mac_int_gen_st       : 1;  //0x2b[4], ,0,R
           volatile uint32_t  cpu1_wifi_hsu_irq_st           : 1;  //0x2b[5], ,0,R
           volatile uint32_t  cpu1_wifi_int_mac_wakeup_st    : 1;  //0x2b[6], ,0,R
           volatile uint32_t  cpu1_dm_irq_st                 : 1;  //0x2b[7], ,0,R
           volatile uint32_t  cpu1_ble_irq_st                : 1;  //0x2b[8], ,0,R
           volatile uint32_t  cpu1_bt_irq_st                 : 1;  //0x2b[9], ,0,R
           volatile uint32_t  reserved2                      : 6;  //0x2b[15:10], ,0,R
           volatile uint32_t  cpu1_mbox0_int_st              : 1;  //0x2b[16], ,0,R
           volatile uint32_t  cpu1_mbox1_int_st              : 1;  //0x2b[17], ,0,R
           volatile uint32_t  cpu1_bmc64_int_st              : 1;  //0x2b[18], ,0,R
           volatile uint32_t  reserved3                      : 1;  //0x2b[19], ,0,R
           volatile uint32_t  cpu1_touched_int_st            : 1;  //0x2b[20], ,0,R
           volatile uint32_t  cpu1_usbplug_int_st            : 1;  //0x2b[21], ,0,R
           volatile uint32_t  cpu1_rtc_int_st                : 1;  //0x2b[22], ,0,R
           volatile uint32_t  cpu1_gpio_int_st               : 1;  //0x2b[23], ,0,R
           volatile uint32_t  reserved4                      : 8;  //0x2b[31:24], ,0,R
        }; 
        uint32_t v; 
    }cpu1_int_32_63_status; 

    /* REG_0x2c */
    union 
    { 
        struct 
        { 
           volatile uint32_t reserved:32;  
        }; 
        uint32_t v; 
    }reg_0x2c_reserved; 

    /* REG_0x2d */
    union 
    { 
        struct 
        { 
           volatile uint32_t reserved:32;  
        }; 
        uint32_t v; 
    }reg_0x2d_reserved; 

    /* REG_0x2e */
    union 
    { 
        struct 
        { 
           volatile uint32_t reserved:32;  
        }; 
        uint32_t v; 
    }reg_0x2e_reserved; 

    /* REG_0x2f */
    union 
    { 
        struct 
        { 
           volatile uint32_t reserved:32;  
        }; 
        uint32_t v; 
    }reg_0x2f_reserved; 

    /* REG_0x30 */
    union 
    { 
        struct 
        { 
           volatile uint32_t  sys_gpio0                      : 4;  //0x30[3:0],0:mode1; 1:mode2; 2:mode3; 3:mode4 4:mode5,0,R/W
           volatile uint32_t  sys_gpio1                      : 4;  //0x30[7:4],0:mode1; 1:mode2; 2:mode3; 3:mode4 4:mode5,0,R/W
           volatile uint32_t  sys_gpio2                      : 4;  //0x30[11:8],0:mode1; 1:mode2; 2:mode3; 3:mode4 4:mode5,0,R/W
           volatile uint32_t  sys_gpio3                      : 4;  //0x30[15:12],0:mode1; 1:mode2; 2:mode3; 3:mode4 4:mode5,0,R/W
           volatile uint32_t  sys_gpio4                      : 4;  //0x30[19:16],0:mode1; 1:mode2; 2:mode3; 3:mode4 4:mode5,0,R/W
           volatile uint32_t  sys_gpio5                      : 4;  //0x30[23:20],0:mode1; 1:mode2; 2:mode3; 3:mode4 4:mode5,0,R/W
           volatile uint32_t  sys_gpio6                      : 4;  //0x30[27:24],0:mode1; 1:mode2; 2:mode3; 3:mode4 4:mode5,0,R/W
           volatile uint32_t  sys_gpio7                      : 4;  //0x30[31:28],0:mode1; 1:mode2; 2:mode3; 3:mode4 4:mode5,0,R/W
        }; 
        uint32_t v; 
    }gpio_config0; 

    /* REG_0x31 */
    union 
    { 
        struct 
        { 
           volatile uint32_t  sys_gpio8                      : 4;  //0x31[3:0],0:mode1; 1:mode2; 2:mode3; 3:mode4 4:mode5,0,R/W
           volatile uint32_t  sys_gpio9                      : 4;  //0x31[7:4],0:mode1; 1:mode2; 2:mode3; 3:mode4 4:mode5,0,R/W
           volatile uint32_t  sys_gpio10                     : 4;  //0x31[11:8],0:mode1; 1:mode2; 2:mode3; 3:mode4 4:mode5,0,R/W
           volatile uint32_t  sys_gpio11                     : 4;  //0x31[15:12],0:mode1; 1:mode2; 2:mode3; 3:mode4 4:mode5,0,R/W
           volatile uint32_t  sys_gpio12                     : 4;  //0x31[19:16],0:mode1; 1:mode2; 2:mode3; 3:mode4 4:mode5,0,R/W
           volatile uint32_t  sys_gpio13                     : 4;  //0x31[23:20],0:mode1; 1:mode2; 2:mode3; 3:mode4 4:mode5,0,R/W
           volatile uint32_t  sys_gpio14                     : 4;  //0x31[27:24],0:mode1; 1:mode2; 2:mode3; 3:mode4 4:mode5,0,R/W
           volatile uint32_t  sys_gpio15                     : 4;  //0x31[31:28],0:mode1; 1:mode2; 2:mode3; 3:mode4 4:mode5,0,R/W
        }; 
        uint32_t v; 
    }gpio_config1; 

