bekencorp/armino/middleware/soc/bk7235/soc/sys_struct.h
    /* REG_0x42 */
    union 
    { 
        struct 
        { 
           volatile uint32_t  pwmscmen                       : 1;  //0x42[0],buck nmos disable,0,R/W
           volatile uint32_t  buck_fasten                    : 1;  //0x42[1],buck EA fast transient enable(=1),1,R/W
           volatile uint32_t  cls                            : 3;  //0x42[4:2],buck current limit setting,7,R/W
           volatile uint32_t  pfms                           : 5;  //0x42[9:5],buck freewheeling damping enable(=1) ,13,R/W
           volatile uint32_t  ripc                           : 3;  //0x42[12:10],buck pfm mode voltage ripple control setting,6,R/W
           volatile uint32_t  rampc                          : 4;  //0x42[16:13],buck ramping compensation setting,7,R/W
           volatile uint32_t  rampcen                        : 1;  //0x42[17],buck ramping compensation enable(=1),1,R/W
           volatile uint32_t  dpfmen                         : 1;  //0x42[18],buck pfm mode current reduce enable(=1),1,R/W
           volatile uint32_t  pfmen                          : 1;  //0x42[19],buck pfm mode enable(=1),1,R/W
           volatile uint32_t  forcepfm                       : 1;  //0x42[20],buck force pfm mode(=1),0,R/W
           volatile uint32_t  swrsten                        : 1;  //0x42[21],buck freewheeling damping enable(=1) ,1,R/W
           volatile uint32_t  tmposel                        : 2;  //0x42[23:22],buck mpo pulse width control 0--shortest   3---longest,2,R/W
           volatile uint32_t  mpoen                          : 1;  //0x42[24],buck mpo mode enable( =1),1,R/W
           volatile uint32_t  spi_latchb                     : 1;  //0x42[25],spi latch disable 0:latch;1:no latch,0,R/W
           volatile uint32_t  ldosel                         : 1;  //0x42[26],ldo/buck select, 0:buck;1:LDO,1,R/W
           volatile uint32_t  iovoc                          : 3;  //0x42[29:27],ioldo output voltage select 0:2.9V,….7:3.6V,4,R/W
           volatile uint32_t  vbpbuf_hp                      : 1;  //0x42[30],vbspbuffer high power enable,1,R/W
           volatile uint32_t  bypassen                       : 1;  //0x42[31],ioldo bypass enable,0,R/W
        }; 
        uint32_t v; 
    }ana_reg2; 

    /* REG_0x43 */
    union 
    { 
        struct 
        { 
           volatile uint32_t  zcdta                          : 5;  //0x43[4:0],buck zcd delay tune setting,1F,R/W
           volatile uint32_t  zcdcala                        : 6;  //0x43[10:5],buck zcd offset cali setting,E,R/W
           volatile uint32_t  zcdmen                         : 1;  //0x43[11],buck zcd manual cali enable(=1),0,R/W
           volatile uint32_t  zcdcalen                       : 1;  //0x43[12],buck zcd calibration enable(=1),0,R/W
           volatile uint32_t  zcdcal_tri                     : 1;  //0x43[13],buck zcd auto cali triggle(0-->1),0,R/W
           volatile uint32_t  mroscsel                       : 1;  //0x43[14],buck oscillator manual cali. enable(=1),0,R/W
           volatile uint32_t  mfsel                          : 3;  //0x43[17:15],buck oscillator manual fsel  ,1,R/W
           volatile uint32_t  mroscbcal                      : 4;  //0x43[21:18],buck oscillator manual cap_cal  0xA---500k 0xB--1M 0x9---2M,6,R/W
           volatile uint32_t  osccaltrig                     : 1;  //0x43[22],buck oscillator manual cali. enable(=1),0,R/W
           volatile uint32_t  ckintsel                       : 1;  //0x43[23],buck clock source select  1-- ring oscillator   0--divider,1,R/W
           volatile uint32_t  ckfs                           : 2;  //0x43[25:24],buck output clock freq. select   0--500k 1---1M  2--2M  3--4M,1,R/W
           volatile uint32_t  vlsel_ldodig                   : 3;  //0x43[28:26],digldo output voltage select(low power)  0:0.6V,…..7:1.4V,4,R/W
           volatile uint32_t  vhsel_ldodig                   : 3;  //0x43[31:29],digldo output voltage select(high power)  0:0.6V,…..7:1.4V,4,R/W
        }; 
        uint32_t v; 
    }ana_reg3; 

    /* REG_0x44 */
    union 
    { 
        struct 
        { 
           volatile uint32_t  nc                             : 5;  //0x44[4:0],Reserved,3,R/W
           volatile uint32_t  cb_manu_val                    : 5;  //0x44[9:5],CB Calibration Manual Value,10,R/W
           volatile uint32_t  cb_cal_trig                    : 1;  //0x44[10],CB Calibration Trigger,0,R/W
           volatile uint32_t  cb_cal_manu                    : 1;  //0x44[11],CB Calibration Manual Mode ,1,R/W
           volatile uint32_t  rosc_cal_intval                : 3;  //0x44[14:12],Rosc Calibration Interlval 0.25s~2s,4,R/W
           volatile uint32_t  manu_cin                       : 7;  //0x44[21:15],Rosc Calibration Manual Cin,40,R/W
           volatile uint32_t  manu_fin                       : 5;  //0x44[26:22],Rosc Calibration Manual Fin,10,R/W
           volatile uint32_t  rosc_cal_mode                  : 1;  //0x44[27],Rosc Calibration Mode:; 0x1: 32K; 0x0: 31.25K,0,R/W
           volatile uint32_t  rosc_cal_trig                  : 1;  //0x44[28],Rosc Calibration Trigger,0,R/W
           volatile uint32_t  rosc_cal_en                    : 1;  //0x44[29],Rosc Calibration Enable,1,R/W
           volatile uint32_t  rosc_manu_en                   : 1;  //0x44[30],Rosc Calibration Manual Mode ,1,R/W
           volatile uint32_t  rosc_tsten                     : 1;  //0x44[31],Rosc test enable,0,R/W
        }; 
        uint32_t v; 
    }ana_reg4; 

    /* REG_0x45 */
    union 
    { 
        struct 
        { 
           volatile uint32_t  vref_scale                     : 1;  //0x45[0],gadc reference voltage scale enable,0,R/W
           volatile uint32_t  dccal_en                       : 1;  //0x45[1],gadc DC calibration enable,0,R/W
           volatile uint32_t  xtalh_ctune                    : 7;  //0x45[8:2],xtalh load cap tuning,0,R/W
           volatile uint32_t  cktst_sel                      : 2;  //0x45[10:9],clock test signal selection rosc/xtall/dco/dpll,0,R/W
           volatile uint32_t  ck_tst_enbale                  : 1;  //0x45[11],system clock test enable,0,R/W
           volatile uint32_t  trxt_tst_enable                : 1;  //0x45[12],wifi trx test enable,0,R/W
           volatile uint32_t  encb                           : 1;  //0x45[13],global central bias enable,1,R/W
           volatile uint32_t  vctrl_dpllldo                  : 2;  //0x45[15:14],dpll ldo output selection,1,R/W
           volatile uint32_t  vctrl_sysldo                   : 2;  //0x45[17:16],sys ldo output selection,3,R/W
           volatile uint32_t  temptst_en                     : 1;  //0x45[18],tempdet test enable,0,R/W
           volatile uint32_t  gadc_tsel                      : 3;  //0x45[21:19],gadc test signal selection,0,R/W
           volatile uint32_t  xtalh_ictrl                    : 1;  //0x45[22],xtalh current control,0,R/W
           volatile uint32_t  bgcalm                         : 6;  //0x45[28:23],bandgap calibration manual setting,20,R/W
           volatile uint32_t  bgcal_trig                     : 1;  //0x45[29],bandgap calibrarion trig,0,R/W
           volatile uint32_t  bgcal_manu                     : 1;  //0x45[30],bandgap calibration manual mode enable,1,R/W
           volatile uint32_t  bgcal_en                       : 1;  //0x45[31],bandgap calibration enable,0,R/W
        }; 
        uint32_t v; 
    }ana_reg5; 

    /* REG_0x46 */
    union 
    { 
        struct 
        { 
           volatile uint32_t  itune_xtall                    : 4;  //0x46[3:0],xtall core current control,7,W
           volatile uint32_t  xtall_ten                      : 1;  //0x46[4],xtall test enable,0,W
           volatile uint32_t  psldo_vsel                     : 1;  //0x46[5],ps ldo output voltage selection,0:VIO /1:1.8V,0,W
           volatile uint32_t  en_usb                         : 1;  //0x46[6],usb phy enable,0,W
           volatile uint32_t  en_xtall                       : 1;  //0x46[7],xtall oscillator enable,0,W
           volatile uint32_t  en_dco                         : 1;  //0x46[8],dco enable,0,W
           volatile uint32_t  en_psram_ldo                   : 1;  //0x46[9],psram ldo enable,0,W
           volatile uint32_t  en_tempdet                     : 1;  //0x46[10],tempreture det enable,0,W
           volatile uint32_t  en_audpll                      : 1;  //0x46[11],audio pll enable,0,W
           volatile uint32_t  en_dpll                        : 1;  //0x46[12],dpll enable,0,W
           volatile uint32_t  en_sysldo                      : 1;  //0x46[13],sysldo enable,1,W
           volatile uint32_t  en_aud                         : 1;  //0x46[14],audio ldo enable,0,W
           volatile uint32_t  pwd_gadc_buf                   : 1;  //0x46[15],gadc input buffer pwd,0,W
           volatile uint32_t  nc                             : 1;  //0x46[16],nc,1,W
           volatile uint32_t  vaon_sel                       : 1;  //0x46[17],0:vddaon drop enable,1,W
           volatile uint32_t  xtal_hpsrr_en                  : 1;  //0x46[18],xtal high psrr buffer enable,1,W
           volatile uint32_t  en_xtal2rf                     : 1;  //0x46[19],xtal clock to rfpll gate enable ,0,W
           volatile uint32_t  en_sleep                       : 1;  //0x46[20],xtal sleep enable,0,W
           volatile uint32_t  clkbuf_hd                      : 1;  //0x46[21],xtal lpsrr clock buffer high power mode ,1,W
           volatile uint32_t  clkbuf_dsel_manu               : 1;  //0x46[22],xtal lpsrr clock buffer power mode selection 0: auto /1:manu ,1,W
           volatile uint32_t  xtal_lpmode_ctrl               : 1;  //0x46[23],xtal core low power mode enable,1,W
           volatile uint32_t  rxtal_lp                       : 4;  //0x46[27:24],xtal bias current setting at low power mode ,F,W
           volatile uint32_t  rxtal_hp                       : 4;  //0x46[31:28],xtal26m bias current setting at high power mode ,F,W
        }; 
        uint32_t v; 
    }ana_reg6; 

    /* REG_0x47 */
    union 
    { 
        struct 
        { 
           volatile uint32_t  rng_tstck_sel                  : 1;  //0x47[0],trng setting,0,W
           volatile uint32_t  rng_tsten                      : 1;  //0x47[1],trng setting,0,W
           volatile uint32_t  itune_ref                      : 3;  //0x47[4:2],trng setting,4,W
           volatile uint32_t  itune_opa                      : 3;  //0x47[7:5],trng setting,7,W
           volatile uint32_t  itune_cmp                      : 3;  //0x47[10:8],trng setting,7,W
           volatile uint32_t  rnooise_sel                    : 1;  //0x47[11],trng setting,0,W
           volatile uint32_t  fslow_sel                      : 3;  //0x47[14:12],trng setting,2,W
           volatile uint32_t  ffast_sel                      : 4;  //0x47[18:15],trng setting,8,W
           volatile uint32_t  gadc_cal_sel                   : 2;  //0x47[20:19],gadc calibration mode selection,0,W
           volatile uint32_t  nc                             : 1;  //0x47[21], ,0,W
           volatile uint32_t  gadc_cmp_ictrl                 : 4;  //0x47[25:22],gadc comparaor current select ,8,W
           volatile uint32_t  gadc_buf_ictrl                 : 4;  //0x47[29:26],gadc buffer current select ,8,W
           volatile uint32_t  vref_sel                       : 1;  //0x47[30],gadc input reference select, 0：bandgap signal 1:GPIO voltage divided,0,W
           volatile uint32_t  scal_en                        : 1;  //0x47[31],gadc reference scale enable, 0:normal mode,1: scale mode ,1,W
        }; 
        uint32_t v; 
    }ana_reg7; 

