bekencorp/armino/middleware/soc/bk7235/soc/sys_struct.h
    /* REG_0x48 */
    union 
    { 
        struct 
        { 
           volatile uint32_t  cap_calspi                     : 9;  //0x48[8:0],manul mode ,input cap calibretion value,0,W
           volatile uint32_t  gain_s                         : 2;  //0x48[10:9],Sensitivity level selection,1,W
           volatile uint32_t  pwd_td                         : 1;  //0x48[11],power down touch module,1,W
           volatile uint32_t  en_fsr                         : 1;  //0x48[12],low power mode ,enable fast response,0,W
           volatile uint32_t  en_scm                         : 1;  //0x48[13],scan mode enable,0,W
           volatile uint32_t  en_adcmode                     : 1;  //0x48[14],adc mode enable,0,W
           volatile uint32_t  en_lpmode                      : 1;  //0x48[15],low power mode enable,0,W
           volatile uint32_t  chs_scan                       :16;  //0x48[31:16],scan mode chan selection,0,W
        }; 
        uint32_t v; 
    }ana_reg8; 

    /* REG_0x49 */
    union 
    { 
        struct 
        { 
           volatile uint32_t  en_otp_spi                     : 1;  //0x49[0],otp ldo spi enable,0,W
           volatile uint32_t  entemp2                        : 1;  //0x49[1],dummy,0,W
           volatile uint32_t  vtempsel                       : 2;  //0x49[3:2],00:nc  01:vtemp  10:vbe   11:vbg1p3,0,W
           volatile uint32_t  vtsel                          : 1;  //0x49[4],dummy,1,W
           volatile uint32_t  en_bias_5u                     : 1;  //0x49[5],Ibias 5u enable,1,W
           volatile uint32_t  dummy2                         : 1;  //0x49[6],5uA channel on(for PLL & DCO),1,W
           volatile uint32_t  touch_serial_cap               : 1;  //0x49[7],1:touch serial capacitors 6pF,1,W
           volatile uint32_t  buckfb_czenb                   : 1;  //0x49[8],buck EA feedback cz selection,1,W
           volatile uint32_t  buckea_cur_ctrl                : 2;  //0x49[10:9],buck EA ibias selection,3,W
           volatile uint32_t  cbtst_en                       : 1;  //0x49[11],CB test enable,0,W
           volatile uint32_t  psldo_vsel                     : 1;  //0x49[12],psldo voltage selsection,0,W
           volatile uint32_t  ovr_l                          : 1;  //0x49[13],ovr low enable,0,W
           volatile uint32_t  usbpen                         : 4;  //0x49[17:14],usb dp driver capability control,8,W
           volatile uint32_t  usbnen                         : 4;  //0x49[21:18],usb dn driver capability control,8,W
           volatile uint32_t  usb_speed                      : 1;  //0x49[22],usb speed selection,0,W
           volatile uint32_t  usb_deepsleep                  : 1;  //0x49[23],usb deepsleep mode enable by spi,0,W
           volatile uint32_t  man_mode                       : 1;  //0x49[24],manul mode enable,0,W
           volatile uint32_t  crg                            : 2;  //0x49[26:25],detect range selection :8pF/12pF/19pF/27pF,2,W
           volatile uint32_t  vrefs                          : 3;  //0x49[29:27],detect threshold selection ,6,W
           volatile uint32_t  nc1                            : 1;  //0x49[30],reserved,0,W
           volatile uint32_t  en_cal                         : 1;  //0x49[31],calibretion enable,0,W
        }; 
        uint32_t v; 
    }ana_reg9;

    /* REG_0x4a */
    union 
    { 
        struct 
        { 
           volatile uint32_t  sdm_val                        :30;  //0x4a[29:0],audio pll sdm value,0F1FAA45,R/W
           volatile uint32_t  vco_hfreq_enb                  : 1;  //0x4a[30],audio pll vco high frequency enb,0,R/W
           volatile uint32_t  cal_refen                      : 1;  //0x4a[31],cal_ref enable of audio pll,1,R/W
        }; 
        uint32_t v; 
    }ana_reg10; 

    /* REG_0x4b */
    union 
    { 
        struct 
        { 
           volatile uint32_t  int_mod                        : 1;  //0x4b[0],DPLL integer mode enable; 0: fractional mode; 1: integer mode,0,R/W
           volatile uint32_t  nsyn                           : 1;  //0x4b[1],DPLL Ncoutner reset ,0,R/W
           volatile uint32_t  open_enb                       : 1;  //0x4b[2], ,0,R/W
           volatile uint32_t  reset                          : 1;  //0x4b[3],DPLL reset,0,R/W
           volatile uint32_t  ioffset                        : 3;  //0x4b[6:4],DPLL  charge pump offset current control,5,R/W
           volatile uint32_t  lpfrz                          : 4;  //0x4b[10:7],DPLL Rz control of LPF,6,R/W
           volatile uint32_t  vsel                           : 3;  //0x4b[13:11],DPLL vtrl selection during VCO band calibration,2,R/W
           volatile uint32_t  vsel_cal                       : 1;  //0x4b[14], selection during VCO band calibration,0,R/W
           volatile uint32_t  pwd_lockdet                    : 1;  //0x4b[15], ,1,R/W
           volatile uint32_t  lockdet_bypass                 : 1;  //0x4b[16], ,0,R/W
           volatile uint32_t  ckref_loop_sel                 : 1;  //0x4b[17],polarity selection of referenc clock  to SDM,0,R/W
           volatile uint32_t  spi_trigger                    : 1;  //0x4b[18],DPLL band calibration spi trigger,0,R/W
           volatile uint32_t  manual                         : 1;  //0x4b[19],DPLL VCO band manual enable; 0: auto mode; 1: manual mode,0,R/W
           volatile uint32_t  test_en                        : 1;  //0x4b[20],test enable,1,R/W
           volatile uint32_t  nc                             : 1;  //0x4b[21],NC; ,1,R/W
           volatile uint32_t  icp                            : 2;  //0x4b[23:22],DPLL charge pump current control; ,3,R/W
           volatile uint32_t  ck26men                        : 1;  //0x4b[24],xtal26M clock for audio enable,0,R/W
           volatile uint32_t  ckaudio_outen                  : 1;  //0x4b[25],DPLL clock output to PAD enable,0,R/W
           volatile uint32_t  divctrl                        : 3;  //0x4b[28:26],DPLL divider control; 000: div1; 001: div2; 010: div4; 011: div8; 1xx: div16,0,R/W
           volatile uint32_t  cksel                          : 1;  //0x4b[29],DPLL divider control; 0: div3; 1: div4,1,R/W
           volatile uint32_t  ck2mcu                         : 1;  //0x4b[30],DPLL clock for mcu enable,0,R/W
           volatile uint32_t  audioen                        : 1;  //0x4b[31],DPLL clock for audio enable,0,R/W
        }; 
        uint32_t v; 
    }ana_reg11; 

    /* REG_0x4c */
    union 
    { 
        struct 
        { 
           volatile uint32_t  nc                             : 2;  //0x4c[1:0],NC,0,R/W
           volatile uint32_t  digmic_ckinv                   : 1;  //0x4c[2],digmic clock inversion enable,0,R/W
           volatile uint32_t  enmicdig                       : 1;  //0x4c[3],digmic enable,0,R/W
           volatile uint32_t  audck_rlcen                    : 1;  //0x4c[4],audio clock re-latch enable,0,R/W
           volatile uint32_t  lchckinven                     : 1;  //0x4c[5],audio clock re-latch clock inversion enable,0,R/W
           volatile uint32_t  ldo1v_vsel1v                   : 3;  //0x4c[8:6],audio 1.0V LDO selection, 000=0.8, 1X1=1.0,0,R/W
           volatile uint32_t  ldo1v_adj                      : 5;  //0x4c[13:9],audio 1.0V LDO output trimming, 00000=min, 11111=max,0,R/W
           volatile uint32_t  audvdd_trm1v                   : 2;  //0x4c[15:14],audio 1.5V LDO selection, 00=min, 11=max,0,R/W
           volatile uint32_t  audvdd_voc1v                   : 5;  //0x4c[20:16],audio 1.5V LDO output trimming, 00000=min, 11111=max,0,R/W
           volatile uint32_t  enaudvdd1v                     : 1;  //0x4c[21],audio 1.0V LDO enable,0,R/W
           volatile uint32_t  loadhp                         : 1;  //0x4c[22],audio 1.5V LDO, 1=good stability with small loading,0,R/W
           volatile uint32_t  enaudvdd1v5                    : 1;  //0x4c[23],audio 1.5V LDO enable,0,R/W
           volatile uint32_t  enmicbias1v                    : 1;  //0x4c[24],micbias enable,0,R/W
           volatile uint32_t  micbias_trim                   : 2;  //0x4c[26:25],micbias output selection, 00=min, 11=max,0,R/W
           volatile uint32_t  micbias_voc1v                  : 5;  //0x4c[31:27],micbias output trimming, 00000=min, 11111=max,0,R/W
        }; 
        uint32_t v; 
    }ana_reg12; 

    /* REG_0x4d */
    union 
    { 
        struct 
        { 
           volatile uint32_t  nc5                            : 8;  //0x4d[7:0],NC,0,R/W
           volatile uint32_t  byp_dwaadc                     : 1;  //0x4d[8],adc dwa pass enable,0,R/W
           volatile uint32_t  rst                            : 1;  //0x4d[9],rst,0,R/W
           volatile uint32_t  adcdwa_mode                    : 1;  //0x4d[10],adc dwa model sel,0,R/W
           volatile uint32_t  vodadjspi                      : 5;  //0x4d[15:11],adc reference manual spi control,10,R/W
           volatile uint32_t  nc4                            : 5;  //0x4d[20:16],NC,0,R/W
           volatile uint32_t  refvsel                        : 1;  //0x4d[21],0= high reference; 1=small reference,0,R/W
           volatile uint32_t  nc3                            : 1;  //0x4d[22],NC,0,R/W
           volatile uint32_t  capsw1v                        : 5;  //0x4d[27:23],munual value for cap trimming,0,R/W
           volatile uint32_t  nc2                            : 2;  //0x4d[29:28],NC,0,R/W
           volatile uint32_t  adcckinven                     : 1;  //0x4d[30],audio adc clock inversion enable,0,R/W
           volatile uint32_t  nc1                            : 1;  //0x4d[31],NC,0,R/W
        }; 
        uint32_t v; 
    }ana_reg13; 

    /* REG_0x4e */
    union 
    { 
        struct 
        { 
           volatile uint32_t  isel                           : 2;  //0x4e[1:0],adc bias trimming,0,R/W
           volatile uint32_t  micdcocdin                     : 8;  //0x4e[9:2],adc micmode dcoc din,0,R/W
           volatile uint32_t  micdcocvc                      : 2;  //0x4e[11:10],adc micmode dcoc control,0,R/W
           volatile uint32_t  micdcocen_n                    : 1;  //0x4e[12],adc micmode dcoc enable,0,R/W
           volatile uint32_t  micdcocen_p                    : 1;  //0x4e[13],adc micmode dcoc enable,0,R/W
           volatile uint32_t  micsingleen                    : 1;  //0x4e[14],adc micmode, single_end enable,0,R/W
           volatile uint32_t  micgain                        : 4;  //0x4e[18:15],adc micmode gain, 0=0dB(17.9K), F=24dB(267.6K), 2dB/step,0,R/W
           volatile uint32_t  micdacen                       : 1;  //0x4e[19],adc micmode micdac enable,0,R/W
           volatile uint32_t  micdacih                       : 8;  //0x4e[27:20],adc micmode, micdac input ,0,R/W
           volatile uint32_t  micdacit                       : 2;  //0x4e[29:28],adc micmode, mic_dac Iout Full-range, 00=280uA, 01=320uA, 1X=447uA,0,R/W
           volatile uint32_t  hcen                           : 1;  //0x4e[30],adc 1stg op current trimming,0,R/W
           volatile uint32_t  micen                          : 1;  //0x4e[31],mic1 mode enable,0,R/W
        }; 
        uint32_t v; 
    }ana_reg14; 

    /* REG_0x4f */
    union 
    { 
        struct 
        { 
           volatile uint32_t  isel                           : 2;  //0x4f[1:0],adc bias trimming,0,R/W
           volatile uint32_t  micdcocdin                     : 8;  //0x4f[9:2],adc micmode dcoc din,0,R/W
           volatile uint32_t  micdcocvc                      : 2;  //0x4f[11:10],adc micmode dcoc control,0,R/W
           volatile uint32_t  micdcocen_n                    : 1;  //0x4f[12],adc micmode dcoc enable,0,R/W
           volatile uint32_t  micdcocen_p                    : 1;  //0x4f[13],adc micmode dcoc enable,0,R/W
           volatile uint32_t  micsingleen                    : 1;  //0x4f[14],adc micmode, single_end enable,0,R/W
           volatile uint32_t  micgain                        : 4;  //0x4f[18:15],adc micmode gain, 0=0dB(17.9K), F=24dB(267.6K), 2dB/step,0,R/W
           volatile uint32_t  micdacen                       : 1;  //0x4f[19],adc micmode micdac enable,0,R/W
           volatile uint32_t  micdacih                       : 8;  //0x4f[27:20],adc micmode, micdac input ,0,R/W
           volatile uint32_t  micdacit                       : 2;  //0x4f[29:28],adc micmode, mic_dac Iout Full-range, 00=280uA, 01=320uA, 1X=447uA,0,R/W
           volatile uint32_t  hcen                           : 1;  //0x4f[30],adc 1stg op current trimming,0,R/W
           volatile uint32_t  micen                          : 1;  //0x4f[31],mic2 mode enable,0,R/W
        }; 
        uint32_t v; 
    }ana_reg15; 

    /* REG_0x50 */
    union 
    { 
        struct 
        { 
           volatile uint32_t  hpdac                          : 1;  //0x50[0],class ab driver high current mode. "1" high current. ,0,R/W
           volatile uint32_t  vcmsdac                        : 1;  //0x50[1],1stg OP input common model voltage selection. "1" low common mode voltage,0,R/W
           volatile uint32_t  oscdac                         : 2;  //0x50[3:2],threshold current setting for over current protection . "3" maximum current. "0" minimum current,0,R/W
           volatile uint32_t  ocendac                        : 1;  //0x50[4],over current protection enable. "1" enable.,0,R/W
           volatile uint32_t  isel_idac                      : 1;  //0x50[5],idac current sel,0,R/W
           volatile uint32_t  adjdacref                      : 5;  //0x50[10:6],audio dac reference voltage adjust.,0,R/W
           volatile uint32_t  nc2                            : 1;  //0x50[11],nc,0,R/W
           volatile uint32_t  dcochg                         : 1;  //0x50[12],dcoc high gain selection. "1" high gain,0,R/W
           volatile uint32_t  diffen                         : 1;  //0x50[13],enable differential mode. "1" enable,0,R/W
           volatile uint32_t  endaccal                       : 1;  //0x50[14],enable offset calibration process. "1" enable.,0,R/W
           volatile uint32_t  rendcoc                        : 1;  //0x50[15],R-channel dcoc dac enablel. "1" enable,0,R/W
           volatile uint32_t  lendcoc                        : 1;  //0x50[16],L-channel Dcoc dac enable. "1" enable,0,R/W
           volatile uint32_t  renvcmd                        : 1;  //0x50[17],R-channel common mode output buffer enable."1" enable,0,R/W
           volatile uint32_t  lenvcmd                        : 1;  //0x50[18],L-channel common mode output buffer enable. "1" enable,0,R/W
           volatile uint32_t  dacdrven                       : 1;  //0x50[19],dac output driver enable."1" enable,0,R/W
           volatile uint32_t  dacren                         : 1;  //0x50[20],dac R-channel enable. "1"  enable,0,R/W
           volatile uint32_t  daclen                         : 1;  //0x50[21],dac L-channel enable. "1" enable,0,R/W
           volatile uint32_t  dacg                           : 3;  //0x50[24:22],dac gain setting: 000=0dB, 111=8dB,0,R/W
           volatile uint32_t  ck4xsel                        : 1;  //0x50[25],dac clock sel ,0,R/W
           volatile uint32_t  dacmute                        : 1;  //0x50[26],dac mute enable. "1" mute enable,0,R/W
           volatile uint32_t  dwamode                        : 1;  //0x50[27],dac dwa mode sel,0,R/W
           volatile uint32_t  ckposel                        : 1;  //0x50[28],dac sample clock edge selection,0,R/W
           volatile uint32_t  nc1                            : 2;  //0x50[30:29],nc,0,R/W
           volatile uint32_t  byldo                          : 1;  //0x50[31],bypass 1v8 LDO,0,R/W
        }; 
        uint32_t v; 
    }ana_reg16; 

    /* REG_0x51 */
    union 
    { 
        struct 
        { 
           volatile uint32_t  lmdcin                         : 8;  //0x51[7:0],l-cnannel offset cancel dac maumual input.,0,R/W
           volatile uint32_t  rmdcin                         : 8;  //0x51[15:8],r-channel offset cancel dac manmual input ,0,R/W
           volatile uint32_t  spirst_ovc                     : 1;  //0x51[16],ovc rst,0,R/W
           volatile uint32_t  nc                             : 3;  //0x51[19:17],NC,0,R/W
           volatile uint32_t  hc2s0v9                        : 1;  //0x51[20],0=current is half,0,R/W
           volatile uint32_t  lvcmsel                        : 1;  //0x51[21],low vcm sel,0,R/W
           volatile uint32_t  loop2sel                       : 1;  //0x51[22],2rd loop sel,0,R/W
           volatile uint32_t  enbias                         : 1;  //0x51[23],dac bias enable,0,R/W
           volatile uint32_t  calck_sel0v9                   : 1;  //0x51[24],offset calibration clock selection. "1" high clock.,0,R/W
           volatile uint32_t  bpdwa0v9                       : 1;  //0x51[25],bypss audio dac dwa. "1" bypass.,0,R/W
           volatile uint32_t  looprst0v9                     : 1;  //0x51[26],audio dac integrator capacitor reset. "1" reset.,0,R/W
           volatile uint32_t  oct0v9                         : 2;  //0x51[28:27],over current delay time setting."11" maximum time. "00" minimum current.,0,R/W
           volatile uint32_t  sout0v9                        : 1;  //0x51[29],short output with 600ohm resistor. "1" short output.,0,R/W
           volatile uint32_t  hc0v9                          : 2;  //0x51[31:30],dac current trimming, 00=minimum current, 11=maximum current,0,R/W
        }; 
        uint32_t v; 
    }ana_reg17; 

