bekencorp/armino/middleware/soc/bk7235/soc/sys_struct.h
    /* REG_0x52 */
    union 
    { 
        struct 
        { 
           volatile uint32_t  ictrl_dsppll                   : 4;  //0x52[3:0],26M PLL setting,7,W
           volatile uint32_t  fbdivn                         :10;  //0x52[13:4],26M PLL setting,0B6,W
           volatile uint32_t  n_mcudsp                       : 5;  //0x52[18:14],26M PLL setting,0E,W
           volatile uint32_t  mode                           : 1;  //0x52[19],26M PLL setting,1,W
           volatile uint32_t  iamsel                         : 1;  //0x52[20],26M PLL setting,0,W
           volatile uint32_t  hvref                          : 2;  //0x52[22:21],26M PLL setting,0,W
           volatile uint32_t  lvref                          : 2;  //0x52[24:23],26M PLL setting,0,W
           volatile uint32_t  nc                             : 7;  //0x52[31:25],26M PLL setting,0,W
        }; 
        uint32_t v; 
    }ana_reg18; 

    /* REG_0x53 */
    union 
    { 
        struct 
        { 
           volatile uint32_t  amsel                          : 1;  //0x53[0],26M PLL setting,0,W
           volatile uint32_t  msw                            : 9;  //0x53[9:1],26M PLL setting,101,W
           volatile uint32_t  tstcken_dpll                   : 1;  //0x53[10],26M PLL setting,0,W
           volatile uint32_t  osccal_trig                    : 1;  //0x53[11],26M PLL setting,1,W
           volatile uint32_t  cnti                           : 9;  //0x53[20:12],26M PLL setting,100,W
           volatile uint32_t  nc                             : 1;  //0x53[21],26M PLL setting,0,W
           volatile uint32_t  spi_rst                        : 1;  //0x53[22],26M PLL setting,0,W
           volatile uint32_t  closeloop_en                   : 1;  //0x53[23],26M PLL setting,1,W
           volatile uint32_t  caltime                        : 1;  //0x53[24],26M PLL setting,1,W
           volatile uint32_t  lpfrz                          : 2;  //0x53[26:25],26M PLL setting,2,W
           volatile uint32_t  icp                            : 4;  //0x53[30:27],26M PLL setting,8,W
           volatile uint32_t  cp2ctrl                        : 1;  //0x53[31],26M PLL setting,0,W
        }; 
        uint32_t v; 
    }ana_reg19; 

} sys_hw_t;

#ifdef __cplusplus 
}                  
#endif             
